{"count":33,"results":[{"id":3,"name":"Robots","description":"Have you ever heard of bots crawling through the internet??\r\n\r\n<b>Link:</b> [Robots](https://hexrobots.netlify.app)","max_attempts":0,"value":1000,"category":"Web Exploitation","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":4,"name":"Never Gonna Give You Up","description":"Find what is in between the files.\r\n\r\n<b>Link:</b> [NeverGiveUp](https://hex-nevergonnagiveyouup.netlify.app/1.html)","max_attempts":0,"value":1000,"category":"Web Exploitation","type":"standard","state":"visible","requirements":null,"connection_info":"","next_id":null},{"id":6,"name":"Bomb","description":"UnZip, Check, Repeat","max_attempts":0,"value":1500,"category":"Forensics","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":7,"name":"HEx Mainframe","description":"Your team has been tipped by one of the rebels of a weak vulnerability in HEx' mainframe\r\ndatabase. Pretending to be HEx', crack the password, and breach into its mainframe where\r\nclassified information is stored. Be careful though, as HEx’ robots are always on high alert\r\nand they keep changing the password.\r\n\r\n<b>Link:</b> [HEx Mainframe](https://hex-mainframe.netlify.app)","max_attempts":0,"value":2000,"category":"Web Exploitation","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":8,"name":"Radio Head","description":"Your team has sent you an email with an audio file that they are unable to understand. They have forwarded the file to you because you possess expertise in analyzing audio files. Your task is to uncover any hidden message within the file and provide assistance to your team.\r\n\r\n(Use underscores in place of spaces.)\r\n\r\nNote: Write the flag as CTF{\\<answer>} with spaces replaced by '\\_'","max_attempts":0,"value":2000,"category":"Forensics","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":9,"name":"Base HEx","description":"Robot16, your secret agent operating within the enemy base, possesses vital information that could significantly influence the outcome of the war in your favor. Unfortunately, Robot16 is currently experiencing internal problems that prevent it from translating the information. However, Robot16 managed to bring back a file. Your urgent task is to decipher the contents of this file and extract the crucial information before time runs out.","max_attempts":0,"value":2500,"category":"Forensics","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":10,"name":"Black Box","description":"Your team has assigned you the responsibility of infiltrating the enemy's server, and after extensive effort, your team has successfully gained access. Within the server, a folder has been discovered. Now, your team has tasked you with extracting all available information from this file, as they are aware that it contains significant and valuable data.","max_attempts":0,"value":2000,"category":"Forensics","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":11,"name":"White Bear","description":"Hexagon is heading towards one of the important checkpoints of Pheins to capture it. Find the flag\r\nand be careful not to let Ultron do something shady. Be aware that a blowfish army guards the\r\ncheckpoint.","max_attempts":0,"value":3000,"category":"Forensics","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":13,"name":"Long Base","description":"At the age of 16, my grandfather drove me to a base located next to house number 64. While there, I came across a mysterious message. My grandfather assured me that I would eventually discover its meaning. Can you assist my younger self in decrypting this message?\r\n襃𠅆時鑧 𓁢𓈰 桨鑲鬰靟 𓄴 鐳椶 ᕽ","max_attempts":0,"value":1000,"category":"Cryptography","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":14,"name":"Emotions","description":"I have a friend who has bipolar disorder, and he seems to be attempting to communicate something. Can you assist me in deciphering his message?\r\n\r\n🙂☹🙂🙂🙂🙂☹☹ 🙂☹🙂☹🙂☹🙂🙂 🙂☹🙂🙂🙂☹☹🙂 🙂☹☹☹☹🙂☹☹ 🙂☹🙂☹☹🙂☹🙂 🙂🙂☹☹🙂🙂☹☹ 🙂☹☹☹🙂🙂☹🙂 🙂🙂☹☹🙂🙂🙂🙂 🙂☹☹☹🙂🙂☹☹ 🙂☹🙂☹☹☹☹☹ 🙂🙂☹☹🙂☹🙂🙂 🙂☹☹🙂☹☹☹🙂 🙂☹☹🙂🙂☹🙂🙂 🙂☹🙂☹☹☹☹☹ 🙂🙂☹☹🙂🙂🙂🙂 🙂☹☹🙂☹☹☹🙂 🙂🙂☹☹🙂🙂☹☹ 🙂☹☹☹🙂🙂☹☹ 🙂☹🙂☹☹☹☹☹ 🙂🙂☹☹🙂☹🙂🙂 🙂☹☹☹🙂🙂☹🙂 🙂🙂☹☹🙂🙂☹☹ 🙂☹🙂☹☹☹☹☹ 🙂☹☹🙂🙂🙂☹🙂 🙂☹☹🙂🙂☹🙂☹ 🙂☹☹☹🙂☹🙂🙂 🙂☹☹☹🙂☹🙂🙂 🙂🙂☹☹🙂🙂☹☹ 🙂☹☹☹🙂🙂☹🙂 🙂☹☹☹☹☹🙂☹","max_attempts":0,"value":1000,"category":"Cryptography","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":15,"name":"Scrambled Eggs","description":"You have been assigned to infiltrate an enemy base where a secret agent is currently hiding. The agent has informed you that accessing the server requires a password, but he doesn't know what the password is. However, he has sent you a file containing information about a code. Your task is to assist your team by deciphering the password from the code provided and executing it correctly.","max_attempts":0,"value":1000,"category":"Reverse Engineering","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":16,"name":"Astro World","description":"You have been entrusted with the task of extracting key information from a file named \"STARS\" that was discovered on an enemy base in sector 19. The base commander, who is now captured, had hidden important information within this file. Your team has been unable to retrieve the information so far, and now it's your responsibility to decipher it.","max_attempts":0,"value":1500,"category":"Reverse Engineering","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":17,"name":"Death Star","description":"In order to infiltrate the heavily secured Pinnacle Tower, our team has devised a plan to create a diversion by disabling the main server. To achieve this, we need to obtain the correct password by analyzing and executing the code provided in the file named \"PINNACLE\" This mission bears a resemblance to an intriguing movie plot reminiscent of \"Star Wars.\"","max_attempts":0,"value":2000,"category":"Reverse Engineering","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":18,"name":"Area 51","description":"As the leader of your team, you embark on a mission to seize the enemy's concealed fortress. Stay vigilant for guards who possess swift reflexes, a commanding presence, and advanced stealth technology. They have Malbolge, a language that is difficult to understand, and they are not afraid to use it. You must find a way to infiltrate the fortress and retrieve the flag.","max_attempts":0,"value":2500,"category":"Forensics","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":19,"name":"Pincode","description":"During our surveillance of Phein's networks, our recon team successfully acquired intel indicating the enemy's diminished strength. Consequently, they sought aid from Hexagon and shared the coordinates of their hidden stronghold. However, pincode of the location was encoded within an image that only Hexagon could decipher. Our recon team relayed this information to us, and now we are tasked with precisely identifying the location. Once determined, our team will proceed to the site and eliminate the remaining enemy forces.","max_attempts":0,"value":1500,"category":"OSINT","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":20,"name":"HelicopterrHelicopterr","description":"You have received a secret message from a squadron of the rebel alliance on Pheins:\r\n\r\nT25lIG9mIG91ciBjcnVjaWFsIGxvY2FsIHRyYW5zcG9ydGF0aW9uIHZlaGljbGUgd2FzIH\r\nN0b2xlbiEgSGVscCB1cyBmaW5kIHRoZSBjdXJyZW50IG93bmVyL293bmVycyBvZiB0a\r\nGUgaGVsaWNvcHRlciB0byBnZXQgdG8gdGhlIHRoZWlmLgooSWYgdGhlcmUgYXJlIH\r\nR3byBvd25lcnMgdGhlbiBjb21iaW5lIHRoZWlyIG5hbWVzIHRvIGdldCB0aGUgZmxhZwo\r\ngRWcuIGZvciBSaXlhIE1hbm9qIGFuZCBTdGFuIFBoaWxpcCB0aGUgZmxhZyBpcyBSa\r\nXlhX1N0YW4pCg==","max_attempts":0,"value":2500,"category":"OSINT","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":22,"name":"Dora Milaje","description":"You have received a secret message from your commander containing instructions disguised with the phrase \"from the lands of vibranium.\" Decrypt the code and proceed accordingly.\r\n\r\nNote: Enter the flag as CTF{\\<answer>} with spaces replaced by '_'\r\n\t\r\n![toughasvibranium.png](/files/fe0828943d1e7237e6854ea194accfa7/toughasvibranium.png)","max_attempts":0,"value":1000,"category":"Cryptography","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":23,"name":"The Imitation Game","description":"Attention! You have been informed by your allies that there exists a crucial code that, once decrypted, could significantly aid in winning the war. Furthermore, you've learned that these types of codes were prominently employed during ancient human conflicts that transpired several decades ago. If you possess the skill and determination to become the Alan Turing of this war, unravel the code and seize the opportunity.\r\n\r\n```copy\r\nXKQKZOHUARFUEUQUBGFUFTJJHSAWVCFDRKZJG\r\n```","max_attempts":0,"value":1000,"category":"Cryptography","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":24,"name":"Breaking Bad","description":"You discover that dangerous chemical weapons are being transported to the enemy base with the intention of using them against you and your allies. Taking matters into your own hands, you manage to seize the supplies, only to find that they are securely locked in a container that requires a passcode to open. Given the nature of these chemicals, it is crucial to handle them safely, and having some knowledge in chemistry will be advantageous. It is important to remember that all substances are made up of elements, each possessing unique chemical and physical properties, and they cannot be transformed into different substances through typical chemical reactions. As a chemistry enthusiast, your task is to decrypt the passcode.\r\n\r\n1 AD 53 EG 45 84 39 22 E 7 T 8 53 A 15 L\r\n\r\n1 59 53 47 113 84 85 23 E 7 T 15 53 73 L\r\n\r\nP.S.- Prime numbers are exceptional indices 😁","max_attempts":0,"value":2000,"category":"Cryptography","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":25,"name":"Euclidian Mythology","description":"Your commander has been captured by the enemies. Your team still has the ability to retrieve your commander out of the enemy base, but your team is in a very weak condition and it needs to be healed. However, during the war enemies had destroyed all your medical supplies. The commander, during the wars had mentioned of a locked safety vault in the base, which was used for keeping medical supplies, but there is a passcode to it and only the commander knows how to open it. Once you reach there, you observe that the following code was written on the safety lock. And on the opening side of the vault. There was written : “A witty little boy from GREEK named Euclid likes natural numbers and in those he is obsessed with numbers which divide (number-1)!+1, he refers to such a number as aphrodite numbers (as he is in love with those numbers). Moreover if an aphrodite number is sum of squares of two aphrodite numbers ,euclid calls such a number as Hermes number and uses such numbers for encrypting messages. He uses a Hermes number less than 729 for this purpose to shift the message.. He sends a message to his pal named Pythagoras ,as Pythagoras is obsessed with a square number which is sum of square of other two numbers ,so obviously he is unable to find hermes number , one of his a buddy named Aryabhatta ,currently reading this question, is going to help him out.” Break the code with the help of the writings on the wall and find the passcode.\r\n\r\nThe code is: `ahxlughihkncdgbl`\r\n\r\nHint :- Euclid denotes n! as the product of all natural numbers appearing before n, with n.","max_attempts":0,"value":3000,"category":"Cryptography","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":26,"name":"Dark Storm","description":"The enemy has launched an artificial hurricane in the path of your allies, with the help of a computer network named AE23444, kept hidden in a safe location at Beaufort. You have to measure the wind speed to analyze where the computer is. Decode the hidden message with the help of HEX to win the war. The message is:\r\n\r\n![hurricanehigh.png](/files/d4a19523b35f0154be3593cef2d89e87/hurricanehigh.png)\r\n\r\nNote: Enter the flag as CTF{\\<answer>} with spaces replaced by '_'","max_attempts":0,"value":2000,"category":"Cryptography","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":27,"name":"Crypto Zoo","description":"Could you please help me find the transaction ID for a recent transfer of 1,000,000,000 DX from the hacker's wallet that occurred on November 26, 2020? The funds were stolen from Kucoin, a well-known cryptocurrency exchange.\r\n\r\nNote: Enter the flag as CTF{\\<answer>}.","max_attempts":0,"value":2000,"category":"OSINT","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":28,"name":"Mysterious IP","description":"```copy\r\n157.240.241.35\r\n```\r\n\r\nWhat is the ASN number and isp of the ip address?\r\n\r\nFlag format: CTF{ASNnumber_ISP}","max_attempts":0,"value":1000,"category":"OSINT","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":29,"name":"Grounded","description":"Hexagon has decided where to attack the next. He only attacks centre of administration of a country. We have intercepted his travel logs from one of our spy. Going through his travel logs, we came across a picture of a socket. Help our team to identify, where is he going to attack ?\r\n\r\n![mysterysocket.png](/files/8fac5bce7682f7a5e7f6976afd4f740b/mysterysocket.png)\r\n\r\nNote: Enter the flag as CTF{\\<answer>} with spaces replaced by '_'","max_attempts":0,"value":1500,"category":"OSINT","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":30,"name":"Come Back","description":"Git is very good friend ! It commits our previous data also.","max_attempts":0,"value":1500,"category":"Forensics","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":31,"name":"Reverse Me","description":"Hexagon gave java a shot, and he made a simple program to authenticate users. Can you crack through it?","max_attempts":0,"value":1500,"category":"Reverse Engineering","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":32,"name":"Learn to submit flag","description":"Flags are case sensitive and all flags should be wrapped in CTF{\\<answer>}. \r\n\r\nType `CTF{THIS_IS_A_FLAG}` in the box below.","max_attempts":0,"value":0,"category":"Getting Started","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":34,"name":"Grandma's Cookie","description":"HQ,\r\n\r\nReconnaissance has uncovered an outdated HEx Galactics website, which may potentially contain an insecure administration portal. Requesting your assistance in investigating the website for any vulnerabilities. Historically, HEx Galactics has not been known for employing top-tier developers.\r\n\r\n[HEx Galactics](https://hex-galactics.netlify.app/)\r\n\r\nAwaiting your findings,\r\nHQ","max_attempts":0,"value":2000,"category":"Web Exploitation","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":35,"name":"Fast as Flash","description":"URGENT HEx-Team,\r\n\r\nOne of the prisoners in the space prison has hacked into the Hexagon educational website and we suspect they have left a message for us. We need your assistance in locating it.\r\n\r\n[HEx Education](https://hex-education.netlify.app/)\r\n\r\nBest of luck,\r\nHQ","max_attempts":0,"value":1500,"category":"Web Exploitation","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":36,"name":"James Webb","description":"We have come across an image file from a covert channel called HexagonFlags, which is known for discreetly transporting flags. Can you analyze the image and see if you can find any useful information?\r\n\r\n![flag.jpg](/files/fa2ae83f5ae3ee662c396a4937faf086/flag.jpg)","max_attempts":0,"value":1000,"category":"Forensics","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":37,"name":"Macro Shot","description":"Does the ancient Word document discovered on one of the Hexagon computers contain any valuable information for us?","max_attempts":0,"value":3000,"category":"Reverse Engineering","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":38,"name":"Banksy","description":"In the dumpster behind Hexagon headquarters, we stumbled upon a collection of shredded document fragments. Could you help us reconstruct the pieces and unveil the hidden message, like unraveling a Banksy artwork?","max_attempts":0,"value":1500,"category":"Reverse Engineering","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null},{"id":39,"name":"M336","description":"Our bot is very friendly ... just ask FLAG .. but it only responds to !!!!!!!!!!\r\n\r\nNote:  Ask our bots, in the designated channels.","max_attempts":0,"value":1000,"category":"Miscellaneous","type":"standard","state":"visible","requirements":null,"connection_info":null,"next_id":null}],"meta":{}}